; domain
(define (domain satellite-advanced)

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object
    direction
)

; ==========================================================
; DIRECTIONS
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento satellite
    (pointing ?d - direction)

    ; evita oscillazioni
    (last-dir ?d - direction)

    ; visibilità oggetti
    (visible ?o - object ?d - direction)

    ; stato invio
    (taken ?o - object)
    (sent ?o - object)

    ; qualità oggetto (NON della foto)
    (quality-hd ?o - object)
    (quality-sd ?o - object)

    ; grafo direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions
    (energy)
    (memory-used)
    (memory-capacity)
    (photo-count)
    (rotation-cost)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE (UNICA)
; ==========================================================

(:action take-picture

    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        (< (photo-count) 2)

        (<= (+ (memory-used) 10) (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (increase (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (increase (memory-used) 10)
        )

        (when (quality-sd ?o)
            (increase (memory-used) 3)
        )
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send
    :parameters (?o - object)

    :precondition (and
        (pointing n)
        (taken ?o)
        (not (sent ?o))
        (>= (energy) 2)
    )

    :effect (and
        (sent ?o)
        (not (taken ?o))

        (decrease (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (decrease (memory-used) 10)
        )

        (when (quality-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-hard-hd)
(:domain satellite-advanced)

(:objects
    star1 planet1 galaxy1 - object
)

(:init

    (pointing sw)
    (last-dir sw)

    (visible star1 e)
    (visible planet1 s)
    (visible galaxy1 nw)

    (quality-hd star1)
    (quality-hd planet1)
    (quality-hd galaxy1)

    (= (energy) 100)
    (= (memory-used) 0)
    (= (memory-capacity) 13)
    (= (photo-count) 0)
    (= (rotation-cost) 0)

    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left ne n)
    (next-left e ne)
    (next-left se e)
    (next-left s se)
    (next-left sw s)
    (next-left w sw)
    (next-left nw w)
    (next-left n nw)
)

(:goal
    (and
        (sent star1)
        (sent planet1)
        (sent galaxy1)
    )
)

(:metric minimize (+ (energy) (rotation-cost)))
)

; plan
1. (rotate-left sw s)
   deleted: (pointing sw) (last-dir sw)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 0 to 2, (energy) from 100 to 99
   goals met: 0 of 3
2. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 2 to 4, (energy) from 99 to 98
   goals met: 0 of 3
3. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 4 to 6, (energy) from 98 to 97
   goals met: 0 of 3
4. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 6 to 8, (energy) from 97 to 96
   goals met: 0 of 3
5. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 8 to 10, (energy) from 96 to 95
   goals met: 0 of 3
6. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 10 to 12, (energy) from 95 to 94
   goals met: 0 of 3
7. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 12 to 14, (energy) from 94 to 93
   goals met: 0 of 3
8. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 14 to 16, (energy) from 93 to 92
   goals met: 0 of 3
9. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 16 to 18, (energy) from 92 to 91
   goals met: 0 of 3
10. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 18 to 20, (energy) from 91 to 90
   goals met: 0 of 3
11. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 20 to 22, (energy) from 90 to 89
   goals met: 0 of 3
12. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 22 to 24, (energy) from 89 to 88
   goals met: 0 of 3
13. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 24 to 26, (energy) from 88 to 87
   goals met: 0 of 3
14. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 26 to 28, (energy) from 87 to 86
   goals met: 0 of 3
15. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 28 to 30, (energy) from 86 to 85
   goals met: 0 of 3
16. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 30 to 32, (energy) from 85 to 84
   goals met: 0 of 3
17. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 32 to 34, (energy) from 84 to 83
   goals met: 0 of 3
18. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 34 to 36, (energy) from 83 to 82
   goals met: 0 of 3
19. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 36 to 38, (energy) from 82 to 81
   goals met: 0 of 3
20. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 38 to 40, (energy) from 81 to 80
   goals met: 0 of 3
21. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 40 to 42, (energy) from 80 to 79
   goals met: 0 of 3
22. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 42 to 44, (energy) from 79 to 78
   goals met: 0 of 3
23. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 44 to 46, (energy) from 78 to 77
   goals met: 0 of 3
24. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 46 to 48, (energy) from 77 to 76
   goals met: 0 of 3
25. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 48 to 50, (energy) from 76 to 75
   goals met: 0 of 3
26. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 50 to 52, (energy) from 75 to 74
   goals met: 0 of 3
27. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 52 to 54, (energy) from 74 to 73
   goals met: 0 of 3
28. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 54 to 56, (energy) from 73 to 72
   goals met: 0 of 3
29. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 56 to 58, (energy) from 72 to 71
   goals met: 0 of 3
30. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 58 to 60, (energy) from 71 to 70
   goals met: 0 of 3
31. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 60 to 62, (energy) from 70 to 69
   goals met: 0 of 3
32. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 62 to 64, (energy) from 69 to 68
   goals met: 0 of 3
33. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 64 to 66, (energy) from 68 to 67
   goals met: 0 of 3
34. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 66 to 68, (energy) from 67 to 66
   goals met: 0 of 3
35. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 68 to 70, (energy) from 66 to 65
   goals met: 0 of 3
36. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 70 to 72, (energy) from 65 to 64
   goals met: 0 of 3
37. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 72 to 74, (energy) from 64 to 63
   goals met: 0 of 3
38. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 74 to 76, (energy) from 63 to 62
   goals met: 0 of 3
39. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 76 to 78, (energy) from 62 to 61
   goals met: 0 of 3
40. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 78 to 80, (energy) from 61 to 60
   goals met: 0 of 3
41. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 80 to 82, (energy) from 60 to 59
   goals met: 0 of 3
42. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 82 to 84, (energy) from 59 to 58
   goals met: 0 of 3
43. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 84 to 86, (energy) from 58 to 57
   goals met: 0 of 3
44. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 86 to 88, (energy) from 57 to 56
   goals met: 0 of 3
45. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 88 to 90, (energy) from 56 to 55
   goals met: 0 of 3
46. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 90 to 92, (energy) from 55 to 54
   goals met: 0 of 3
47. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 92 to 94, (energy) from 54 to 53
   goals met: 0 of 3
48. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 94 to 96, (energy) from 53 to 52
   goals met: 0 of 3
49. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 96 to 98, (energy) from 52 to 51
   goals met: 0 of 3
50. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 98 to 100, (energy) from 51 to 50
   goals met: 0 of 3
51. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 100 to 102, (energy) from 50 to 49
   goals met: 0 of 3
52. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 102 to 104, (energy) from 49 to 48
   goals met: 0 of 3
53. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 104 to 106, (energy) from 48 to 47
   goals met: 0 of 3
54. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 106 to 108, (energy) from 47 to 46
   goals met: 0 of 3
55. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 108 to 110, (energy) from 46 to 45
   goals met: 0 of 3
56. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 110 to 112, (energy) from 45 to 44
   goals met: 0 of 3
57. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 112 to 114, (energy) from 44 to 43
   goals met: 0 of 3
58. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 114 to 116, (energy) from 43 to 42
   goals met: 0 of 3
59. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 116 to 118, (energy) from 42 to 41
   goals met: 0 of 3
60. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 118 to 120, (energy) from 41 to 40
   goals met: 0 of 3
61. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 120 to 122, (energy) from 40 to 39
   goals met: 0 of 3
62. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 122 to 124, (energy) from 39 to 38
   goals met: 0 of 3
63. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 124 to 126, (energy) from 38 to 37
   goals met: 0 of 3
64. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 126 to 128, (energy) from 37 to 36
   goals met: 0 of 3
65. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 128 to 130, (energy) from 36 to 35
   goals met: 0 of 3
66. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 130 to 132, (energy) from 35 to 34
   goals met: 0 of 3
67. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 132 to 134, (energy) from 34 to 33
   goals met: 0 of 3
68. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 134 to 136, (energy) from 33 to 32
   goals met: 0 of 3
69. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 136 to 138, (energy) from 32 to 31
   goals met: 0 of 3
70. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 138 to 140, (energy) from 31 to 30
   goals met: 0 of 3
71. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 140 to 142, (energy) from 30 to 29
   goals met: 0 of 3
72. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 142 to 144, (energy) from 29 to 28
   goals met: 0 of 3
73. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 144 to 146, (energy) from 28 to 27
   goals met: 0 of 3
74. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 146 to 148, (energy) from 27 to 26
   goals met: 0 of 3
75. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 148 to 150, (energy) from 26 to 25
   goals met: 0 of 3
76. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 150 to 152, (energy) from 25 to 24
   goals met: 0 of 3
77. (rotate-right se s)
   deleted: (pointing se) (last-dir se)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 152 to 154, (energy) from 24 to 23
   goals met: 0 of 3
78. (take-picture planet1 s)
   added: (taken planet1)
   changed: (photo-count) from 0 to 1, (energy) from 23 to 21, (memory-used) from 0 to 10
   goals met: 0 of 3
79. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 154 to 156, (energy) from 21 to 20
   goals met: 0 of 3
80. (rotate-left se e)
   deleted: (pointing se) (last-dir se)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 156 to 158, (energy) from 20 to 19
   goals met: 0 of 3
81. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 158 to 160, (energy) from 19 to 18
   goals met: 0 of 3
82. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 160 to 162, (energy) from 18 to 17
   goals met: 0 of 3
83. (send planet1)
   deleted: (taken planet1)
   added: (sent planet1)
   changed: (photo-count) from 1 to 0, (energy) from 17 to 15, (memory-used) from 10 to 0
   goals met: 1 of 3
84. (rotate-left n nw)
   deleted: (pointing n) (last-dir n)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 162 to 164, (energy) from 15 to 14
   goals met: 1 of 3
85. (take-picture galaxy1 nw)
   added: (taken galaxy1)
   changed: (photo-count) from 0 to 1, (energy) from 14 to 12, (memory-used) from 0 to 10
   goals met: 1 of 3
86. (rotate-right nw n)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 164 to 166, (energy) from 12 to 11
   goals met: 1 of 3
87. (send galaxy1)
   deleted: (taken galaxy1)
   added: (sent galaxy1)
   changed: (photo-count) from 1 to 0, (energy) from 11 to 9, (memory-used) from 10 to 0
   goals met: 2 of 3
88. (rotate-right n ne)
   deleted: (pointing n) (last-dir n)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 166 to 168, (energy) from 9 to 8
   goals met: 2 of 3
89. (rotate-right ne e)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 168 to 170, (energy) from 8 to 7
   goals met: 2 of 3
90. (take-picture star1 e)
   added: (taken star1)
   changed: (photo-count) from 0 to 1, (energy) from 7 to 5, (memory-used) from 0 to 10
   goals met: 2 of 3
91. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 170 to 172, (energy) from 5 to 4
   goals met: 2 of 3
92. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 172 to 174, (energy) from 4 to 3
   goals met: 2 of 3
93. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 1 to 0, (energy) from 3 to 1, (memory-used) from 10 to 0
   goals met: 3 of 3
